{
    "name": "Backpacks?",
    "category": "patchouli:features",
    "icon": "spectrum:bottomless_bundle",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "  There are several ways to increase your inventory space or help condense what you're carrying, described here."
        },
        {
            "type": "patchouli:spotlight",
            "item": "packages:package_maker",
            "title": "Packages",
            "text": "  Packages can be constructed in the Package Crafter block. These can store up to 512 of any one thing, and can be interacted with in the inventory similarly to a bundle. Additionally, packages can store other packages, allowing you to store vast amounts of a single item in one slot."
        },
        {
            "type": "patchouli:text",
            "title": "Packages (cont.)",
            "text": "  Packages are also placeable, and can be manipulated similarly to shulker boxes - pistons crush them, dispensers place them, and items may be inserted or extracted from them."
        },
        {
            "type": "spectrum:collection",
            "items": [ "scout:pouch", "scout:satchel", "scout:upgraded_pouch", "scout:upgraded_satchel" ],
            "title": "Storage Trinkets",
            "text": "  You can equip, in your trinket slots, up to two Pouches and one Satchel, which physically expand your inventory space. They retain their inventory when taken off, as well."
        },
        {
            "type": "patchouli:spotlight",
            "item": "minecraft:bundle",
            "title": "Bundles",
            "text": "  Bundles are craftable, and in addition to their vanilla behavior, you may scroll with the mousewheel over them to cycle the items inside."
        },
        {
            "type": "spectrum:collection",
            "items": [ "spectrum:bottomless_bundle", "botania:black_hole_talisman" ],
            "title": "Hoarding",
            "text": "  When mining, you find plenty of ore and treasure, but also plenty of other blocks like stone. You may not prefer to throw them away, but there may come a point when packages are not enough to carry them home. Thus, these two items are specifically for carrying a large amount of one thing - such as stone."
        }
    ]
}
